*> * This needs to be compiled with the -free command line switch
IDENTIFICATION DIVISION.
PROGRAM-ID. HelloWorld.
PROCEDURE DIVISION.
  DISPLAY "Hi World I am free form cobol!".
