      * My first cobol program (fixed mode)
      d a comment
      * a comment
      / a comment
      D a comment

       Identification Division.
       program-id. HelloWorld.
       Procedure Division.
             display "Hi World I am an old school cobol program!".
