       >>SOURCE FORMAT IS FREE

*> The "SOURCE FORMAT IS FREE" line must start on line 8+

IDENTIFICATION DIVISION.
PROGRAM-ID. HelloWorld.
PROCEDURE DIVISION.
  DISPLAY "Hi World I am free form cobol!".
