       >>SOURCE FORMAT IS FREE
* single line comments start with a *, no multi-line comments
*> The "SOURCE FORMAT IS FREE" line must start on line 8+

IDENTIFICATION DIVISION.
PROGRAM-ID. HelloWorld.
PROCEDURE DIVISION.
  DISPLAY "Hi World I am free form cobol!".
