      * ************************************************************** *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.

      * ************************************************************** *
       PROCEDURE DIVISION.
           DISPLAY "Hi World I am an old school cobol program!!!".
           STOP RUN.
